perf/scenarios/spike-testing/fact.yaml
config:
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  environments:
    base-case:
      target: "http://localhost:5555/api/fact"
    cache:
      target: 'http://localhost:5555/api/fact?cache=true&cacheFillAmount=30'
    replication:
      target: "http://localhost:5555/replicated_api/fact"
    rate-limiting:
      target: "http://localhost:5555/api/limited/fact"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # TODO: Configurar para que tenga una falla y luego que funcione bien
  phases:
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500

scenarios:
  - name: Useless Facts - Root (/)
    flow:
      - get:
          url: "/"