perf/scenarios/spike-testing/metar.yaml
config:
  payload:
    path: "../payloads/stations.csv"
    fields:
      - "station"
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  environments:
    base-case:
      target: "http://localhost:5555/api/metar"
      variables:
        cache: "false"
    cache:
      target: "http://localhost:5555/api/metar"
      variables:
        cache: "true"
    replication:
      target: "http://localhost:5555/replicated_api/metar"
      variables:
        cache: "false"
    rate-limiting:
      target: "http://localhost:5555/api/limited/metar"
      variables:
        cache: "false"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # TODO: Configurar para que tenga una falla y luego que funcione bien
  phases:
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500

scenarios:
  - name: METAR - Root (/)
    flow:
      - get:
          url: "/"
          qs:
            cache: "{{ cache }}"
            station: "{{ station }}"