perf/scenarios/spike-testing/space-news.yaml
config:
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  environments:
    base-case:
      target: "http://localhost:5555/api/space_news"
    cache:
      target: "http://localhost:5555/api/space_news?cache=true"
    replication:
      target: "http://localhost:5555/replicated_api/space_news"
    rate-limiting:
      target: "http://localhost:5555/api/limited/space_news"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # TODO: Configurar para que tenga una falla y luego que funcione bien
  phases:
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500
    - name: normal period
      duration: 30
      arrivalRate: 20
    - name: spike period
      duration: 30
      arrivalRate: 500

scenarios:
  - name: Space news - Root (/)
    flow:
      - get:
          url: "/"